/* ----------------------------------------------------------------------------
 *  IN-12b ニキシー管表示ユニット制御プログラム
 *  シリアル通信
 *
 *  Author. 楠 昌浩(Masahiro Kusunoki)
 *  http://mkusunoki.net
 *  Release 20131011 Rev 001
 * ---------------------------------------------------------------------------- */
#include <avr/io.h>
#include <avr/sfr_defs.h>
#include "USART.h"

/* ----------------------------------------------------------------------------
 *  クラスインスタンス
 * ---------------------------------------------------------------------------- */
USART::USART() {
	;
}

/* ----------------------------------------------------------------------------
 *  シリアル通信初期化
 * ---------------------------------------------------------------------------- */
void USART::begin(void) {
	
	rxBufStoIdx = 0;
	rxBufGetIdx = 0;

	DDRD |= (1<<PORTD3);
	DDRD &= ~(1<<PORTD2);
	// ボーレートレジスタ
	// 16MHz / 16 / 9600 - 1 = 103
	// 16MHz / 16 / 19200 - 1 = 51
	// 16MHz / 16 / 38400 - 1 = 25
	//UBRR1H = 0;
	//UBRR1L = 51;
	UBRR1H = (UBRRVAL>>8);
	UBRR1L = UBRRVAL;
	// 非同期モード
	UCSR1C &= ~(1<<UMSEL11);
	UCSR1C &= ~(1<<UMSEL10);
	// パリティなし
	UCSR1C &= ~(1<<UPM11); 
	UCSR1C &= ~(1<<UPM10);
	// ストップビット 1
	UCSR1C &= ~(1<<USBS1);
	// データビット 8ビット
	UCSR1B &= ~(1<<UCSZ12);
	UCSR1C |= (1<<UCSZ11);
	UCSR1C |= (1<<UCSZ10);
	// 送受信有効
	UCSR1B |= (1<<RXEN1);
	UCSR1B |= (1<<TXEN1);
	// 受信割り込み有効
	//UCSR1B |= (1<<RXCIE1);
}

/* ----------------------------------------------------------------------------
 *  文字列出力
 * ---------------------------------------------------------------------------- */
void USART::putstr(char *buf) {

	while(*buf) {
		putch(*buf++);
	}	
}

/* ----------------------------------------------------------------------------
 *  1 文字列出力
 * ---------------------------------------------------------------------------- */
void USART::putch(char ch) {
	
	loop_until_bit_is_set(UCSR1A, UDRE1);
	UDR1 = ch;
}

/* ----------------------------------------------------------------------------
 *  シリアル受信処理
 * ---------------------------------------------------------------------------- */
void USART::getrxd() {
	
	if(bit_is_set(UCSR1A, RXC1)) {
		rxBuf[rxBufStoIdx++] = UDR1;
		if(rxBufStoIdx >= USARTBUF_LEN) {
			rxBufStoIdx = 0;
		}
	}
}

/* ----------------------------------------------------------------------------
 *  バッファから 1 文字取り出し
 * ---------------------------------------------------------------------------- */
char USART::getch() {
	
	char ch;
	if(rxBufStoIdx != rxBufGetIdx) {
		ch = rxBuf[rxBufGetIdx++];
		if(rxBufGetIdx >= USARTBUF_LEN) {
			rxBufGetIdx = 0;
		}
		return(ch);
	} else {
		return(0);
	}
}

/* ----------------------------------------------------------------------------
 *  バッファの文字数を返す
 * ---------------------------------------------------------------------------- */
int USART::available() {
	
	if(rxBufStoIdx == rxBufGetIdx) {
		return(0);
	}

	if(rxBufStoIdx > rxBufGetIdx) {
		return(rxBufStoIdx - rxBufGetIdx);
	} else {
		return(USARTBUF_LEN - rxBufGetIdx + rxBufStoIdx);
	}
}
